In [1]:
from pyspark.sql import SparkSession

In [3]:
spark_session = SparkSession.builder.appName("handling_missing_data").getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/10/07 17:20:54 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/10/07 17:20:55 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
23/10/07 17:20:55 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.

In [4]:
spark_session

In [25]:
df = spark_session.read.csv("./data/pii_data.csv", header=True, inferSchema=True)

In [26]:
df.show()

+-----------------+----+------+--------------------+--------------------+------+
|             Name| Age|   Sex|             Address|             Contact|Salary|
+-----------------+----+------+--------------------+--------------------+------+
|         John Doe|  30|  Male|   123 Main St, City|    john@example.com| 50000|
|       Jane Smith|  25|Female|    456 Elm St, Town|    jane@example.com| 45000|
|   Robert Johnson|  35|  Male| 789 Oak St, Village|  robert@example.com| 60000|
|      Emily Davis|  28|Female| 101 Pine St, Hamlet|   emily@example.com| 55000|
|    Michael Brown|  40|  NULL|222 Cedar St, County| michael@example.com| 70000|
|     Sarah Wilson|  33|Female|333 Maple St, Suburb|   sarah@example.com|  NULL|
|     James Miller|  29|  Male|444 Birch St, Tow...|   james@example.com| 52000|
|      Lisa Garcia|  27|  NULL|555 Oakwood St, Town|    lisa@example.com| 48000|
|      William Lee|  38|  NULL|666 Pinecrest St,...| william@example.com|  NULL|
|    Olivia Taylor|  31|Female|777 Elmwood St, C...|  olivia@example.com| 57000|
|  Daniel Martinez|NULL|  Male|                NULL|  daniel@example.com|  NULL|
|    Sophia Harris|  26|Female|999 Cedarwood St,...|  sophia@example.com| 47000|
|Christopher Davis|  34|  Male|111 Oakside St, V...|   chris@example.com| 61000|
|    Emma Anderson|  24|Female|222 Elmridge St, ...|    emma@example.com| 44000|
|     Joseph Smith|  37|  Male|333 Birchwood St,...|  joseph@example.com| 63000|
|      Mia Johnson|  30|Female|444 Maplewood St,...|     mia@example.com| 49000|
|     David Wilson|  36|  Male|555 Pinehurst St,...|   david@example.com| 64000|
|        Ava Brown|  28|Female|666 Oakridge St, ...|     ava@example.com| 46000|
|  Benjamin Taylor|  39|  Male|777 Cedarhurst St...|benjamin@example.com| 65000|
|    Charlotte Lee|  29|Female|888 Elmridge St, ...|charlotte@example...| 50000|
+-----------------+----+------+--------------------+--------------------+------+

In [27]:
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Address: string (nullable = true)
 |-- Contact: string (nullable = true)
 |-- Salary: integer (nullable = true)

### Dropping columns

In [28]:
df.drop("Age").show()

+-----------------+------+--------------------+--------------------+------+
|             Name|   Sex|             Address|             Contact|Salary|
+-----------------+------+--------------------+--------------------+------+
|         John Doe|  Male|   123 Main St, City|    john@example.com| 50000|
|       Jane Smith|Female|    456 Elm St, Town|    jane@example.com| 45000|
|   Robert Johnson|  Male| 789 Oak St, Village|  robert@example.com| 60000|
|      Emily Davis|Female| 101 Pine St, Hamlet|   emily@example.com| 55000|
|    Michael Brown|  NULL|222 Cedar St, County| michael@example.com| 70000|
|     Sarah Wilson|Female|333 Maple St, Suburb|   sarah@example.com|  NULL|
|     James Miller|  Male|444 Birch St, Tow...|   james@example.com| 52000|
|      Lisa Garcia|  NULL|555 Oakwood St, Town|    lisa@example.com| 48000|
|      William Lee|  NULL|666 Pinecrest St,...| william@example.com|  NULL|
|    Olivia Taylor|Female|777 Elmwood St, C...|  olivia@example.com| 57000|
|  Daniel Martinez|  Male|                NULL|  daniel@example.com|  NULL|
|    Sophia Harris|Female|999 Cedarwood St,...|  sophia@example.com| 47000|
|Christopher Davis|  Male|111 Oakside St, V...|   chris@example.com| 61000|
|    Emma Anderson|Female|222 Elmridge St, ...|    emma@example.com| 44000|
|     Joseph Smith|  Male|333 Birchwood St,...|  joseph@example.com| 63000|
|      Mia Johnson|Female|444 Maplewood St,...|     mia@example.com| 49000|
|     David Wilson|  Male|555 Pinehurst St,...|   david@example.com| 64000|
|        Ava Brown|Female|666 Oakridge St, ...|     ava@example.com| 46000|
|  Benjamin Taylor|  Male|777 Cedarhurst St...|benjamin@example.com| 65000|
|    Charlotte Lee|Female|888 Elmridge St, ...|charlotte@example...| 50000|
+-----------------+------+--------------------+--------------------+------+

In [29]:
df.drop(*["Age", "Address"]).show()

+-----------------+------+--------------------+------+
|             Name|   Sex|             Contact|Salary|
+-----------------+------+--------------------+------+
|         John Doe|  Male|    john@example.com| 50000|
|       Jane Smith|Female|    jane@example.com| 45000|
|   Robert Johnson|  Male|  robert@example.com| 60000|
|      Emily Davis|Female|   emily@example.com| 55000|
|    Michael Brown|  NULL| michael@example.com| 70000|
|     Sarah Wilson|Female|   sarah@example.com|  NULL|
|     James Miller|  Male|   james@example.com| 52000|
|      Lisa Garcia|  NULL|    lisa@example.com| 48000|
|      William Lee|  NULL| william@example.com|  NULL|
|    Olivia Taylor|Female|  olivia@example.com| 57000|
|  Daniel Martinez|  Male|  daniel@example.com|  NULL|
|    Sophia Harris|Female|  sophia@example.com| 47000|
|Christopher Davis|  Male|   chris@example.com| 61000|
|    Emma Anderson|Female|    emma@example.com| 44000|
|     Joseph Smith|  Male|  joseph@example.com| 63000|
|      Mia Johnson|Female|     mia@example.com| 49000|
|     David Wilson|  Male|   david@example.com| 64000|
|        Ava Brown|Female|     ava@example.com| 46000|
|  Benjamin Taylor|  Male|benjamin@example.com| 65000|
|    Charlotte Lee|Female|charlotte@example...| 50000|
+-----------------+------+--------------------+------+

In [30]:
df.show(5)

+--------------+---+------+--------------------+-------------------+------+
|          Name|Age|   Sex|             Address|            Contact|Salary|
+--------------+---+------+--------------------+-------------------+------+
|      John Doe| 30|  Male|   123 Main St, City|   john@example.com| 50000|
|    Jane Smith| 25|Female|    456 Elm St, Town|   jane@example.com| 45000|
|Robert Johnson| 35|  Male| 789 Oak St, Village| robert@example.com| 60000|
|   Emily Davis| 28|Female| 101 Pine St, Hamlet|  emily@example.com| 55000|
| Michael Brown| 40|  NULL|222 Cedar St, County|michael@example.com| 70000|
+--------------+---+------+--------------------+-------------------+------+
only showing top 5 rows

### Dropping rows

In [31]:
# Drow row if there is a NULL value in any column
df.na.drop().show(5) # In the above table row 5 has been deleted, where Sex has a NULL value

+--------------+---+------+--------------------+------------------+------+
|          Name|Age|   Sex|             Address|           Contact|Salary|
+--------------+---+------+--------------------+------------------+------+
|      John Doe| 30|  Male|   123 Main St, City|  john@example.com| 50000|
|    Jane Smith| 25|Female|    456 Elm St, Town|  jane@example.com| 45000|
|Robert Johnson| 35|  Male| 789 Oak St, Village|robert@example.com| 60000|
|   Emily Davis| 28|Female| 101 Pine St, Hamlet| emily@example.com| 55000|
|  James Miller| 29|  Male|444 Birch St, Tow...| james@example.com| 52000|
+--------------+---+------+--------------------+------------------+------+
only showing top 5 rows

In [32]:
# how = any, default is any
df.na.drop(how="any").show(5)

+--------------+---+------+--------------------+------------------+------+
|          Name|Age|   Sex|             Address|           Contact|Salary|
+--------------+---+------+--------------------+------------------+------+
|      John Doe| 30|  Male|   123 Main St, City|  john@example.com| 50000|
|    Jane Smith| 25|Female|    456 Elm St, Town|  jane@example.com| 45000|
|Robert Johnson| 35|  Male| 789 Oak St, Village|robert@example.com| 60000|
|   Emily Davis| 28|Female| 101 Pine St, Hamlet| emily@example.com| 55000|
|  James Miller| 29|  Male|444 Birch St, Tow...| james@example.com| 52000|
+--------------+---+------+--------------------+------------------+------+
only showing top 5 rows

In [38]:
# how = all
# Here, we don't have NULL value in all columns so, row 5 is not dropped
df.na.drop(how="all").show(11)

+---------------+----+------+--------------------+-------------------+------+
|           Name| Age|   Sex|             Address|            Contact|Salary|
+---------------+----+------+--------------------+-------------------+------+
|       John Doe|  30|  Male|   123 Main St, City|   john@example.com| 50000|
|     Jane Smith|  25|Female|    456 Elm St, Town|   jane@example.com| 45000|
| Robert Johnson|  35|  Male| 789 Oak St, Village| robert@example.com| 60000|
|    Emily Davis|  28|Female| 101 Pine St, Hamlet|  emily@example.com| 55000|
|  Michael Brown|  40|  NULL|222 Cedar St, County|michael@example.com| 70000|
|   Sarah Wilson|  33|Female|333 Maple St, Suburb|  sarah@example.com|  NULL|
|   James Miller|  29|  Male|444 Birch St, Tow...|  james@example.com| 52000|
|    Lisa Garcia|  27|  NULL|555 Oakwood St, Town|   lisa@example.com| 48000|
|    William Lee|  38|  NULL|666 Pinecrest St,...|william@example.com|  NULL|
|  Olivia Taylor|  31|Female|777 Elmwood St, C...| olivia@example.com| 57000|
|Daniel Martinez|NULL|  Male|                NULL| daniel@example.com|  NULL|
+---------------+----+------+--------------------+-------------------+------+
only showing top 11 rows

In [39]:
# thres = 4
# It means at least 4 columns should be non-NULL
df.na.drop(how="all", thresh=4).show(11) # 11th row has been deleted because it has only 3 non-NULL columns

+--------------+---+------+--------------------+-------------------+------+
|          Name|Age|   Sex|             Address|            Contact|Salary|
+--------------+---+------+--------------------+-------------------+------+
|      John Doe| 30|  Male|   123 Main St, City|   john@example.com| 50000|
|    Jane Smith| 25|Female|    456 Elm St, Town|   jane@example.com| 45000|
|Robert Johnson| 35|  Male| 789 Oak St, Village| robert@example.com| 60000|
|   Emily Davis| 28|Female| 101 Pine St, Hamlet|  emily@example.com| 55000|
| Michael Brown| 40|  NULL|222 Cedar St, County|michael@example.com| 70000|
|  Sarah Wilson| 33|Female|333 Maple St, Suburb|  sarah@example.com|  NULL|
|  James Miller| 29|  Male|444 Birch St, Tow...|  james@example.com| 52000|
|   Lisa Garcia| 27|  NULL|555 Oakwood St, Town|   lisa@example.com| 48000|
|   William Lee| 38|  NULL|666 Pinecrest St,...|william@example.com|  NULL|
| Olivia Taylor| 31|Female|777 Elmwood St, C...| olivia@example.com| 57000|
| Sophia Harris| 26|Female|999 Cedarwood St,...| sophia@example.com| 47000|
+--------------+---+------+--------------------+-------------------+------+
only showing top 11 rows

In [44]:
# Subset, specify particular columns to delete
df.na.drop(how="all", subset=["Sex"]).show(11) # drops all the rows having Sex == NULL

+-----------------+----+------+--------------------+------------------+------+
|             Name| Age|   Sex|             Address|           Contact|Salary|
+-----------------+----+------+--------------------+------------------+------+
|         John Doe|  30|  Male|   123 Main St, City|  john@example.com| 50000|
|       Jane Smith|  25|Female|    456 Elm St, Town|  jane@example.com| 45000|
|   Robert Johnson|  35|  Male| 789 Oak St, Village|robert@example.com| 60000|
|      Emily Davis|  28|Female| 101 Pine St, Hamlet| emily@example.com| 55000|
|     Sarah Wilson|  33|Female|333 Maple St, Suburb| sarah@example.com|  NULL|
|     James Miller|  29|  Male|444 Birch St, Tow...| james@example.com| 52000|
|    Olivia Taylor|  31|Female|777 Elmwood St, C...|olivia@example.com| 57000|
|  Daniel Martinez|NULL|  Male|                NULL|daniel@example.com|  NULL|
|    Sophia Harris|  26|Female|999 Cedarwood St,...|sophia@example.com| 47000|
|Christopher Davis|  34|  Male|111 Oakside St, V...| chris@example.com| 61000|
|    Emma Anderson|  24|Female|222 Elmridge St, ...|  emma@example.com| 44000|
+-----------------+----+------+--------------------+------------------+------+
only showing top 11 rows

### Filling the missing values

In [45]:
# Fill the missing values in the entire dataset
df.na.fill(-1).show(10) # Here we filled missing NULL values by -1

+--------------+---+------+--------------------+-------------------+------+
|          Name|Age|   Sex|             Address|            Contact|Salary|
+--------------+---+------+--------------------+-------------------+------+
|      John Doe| 30|  Male|   123 Main St, City|   john@example.com| 50000|
|    Jane Smith| 25|Female|    456 Elm St, Town|   jane@example.com| 45000|
|Robert Johnson| 35|  Male| 789 Oak St, Village| robert@example.com| 60000|
|   Emily Davis| 28|Female| 101 Pine St, Hamlet|  emily@example.com| 55000|
| Michael Brown| 40|  NULL|222 Cedar St, County|michael@example.com| 70000|
|  Sarah Wilson| 33|Female|333 Maple St, Suburb|  sarah@example.com|    -1|
|  James Miller| 29|  Male|444 Birch St, Tow...|  james@example.com| 52000|
|   Lisa Garcia| 27|  NULL|555 Oakwood St, Town|   lisa@example.com| 48000|
|   William Lee| 38|  NULL|666 Pinecrest St,...|william@example.com|    -1|
| Olivia Taylor| 31|Female|777 Elmwood St, C...| olivia@example.com| 57000|
+--------------+---+------+--------------------+-------------------+------+
only showing top 10 rows

In [54]:
# Specify the column names if you want to fill missing values only in those columns
df.na.fill(-1, subset=["Sex", "Salary"]).show(10) #If both subset sex and salary has NULL value, only then fill missing value

+--------------+---+------+--------------------+-------------------+------+
|          Name|Age|   Sex|             Address|            Contact|Salary|
+--------------+---+------+--------------------+-------------------+------+
|      John Doe| 30|  Male|   123 Main St, City|   john@example.com| 50000|
|    Jane Smith| 25|Female|    456 Elm St, Town|   jane@example.com| 45000|
|Robert Johnson| 35|  Male| 789 Oak St, Village| robert@example.com| 60000|
|   Emily Davis| 28|Female| 101 Pine St, Hamlet|  emily@example.com| 55000|
| Michael Brown| 40|  NULL|222 Cedar St, County|michael@example.com| 70000|
|  Sarah Wilson| 33|Female|333 Maple St, Suburb|  sarah@example.com|    -1|
|  James Miller| 29|  Male|444 Birch St, Tow...|  james@example.com| 52000|
|   Lisa Garcia| 27|  NULL|555 Oakwood St, Town|   lisa@example.com| 48000|
|   William Lee| 38|  NULL|666 Pinecrest St,...|william@example.com|    -1|
| Olivia Taylor| 31|Female|777 Elmwood St, C...| olivia@example.com| 57000|
+--------------+---+------+--------------------+-------------------+------+
only showing top 10 rows

### Handling missing values by Mean, Median and Mode
    - Mean

In [57]:
# Method 1: let's use Imputer
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols = ["Age", "Salary"],
    outputCols = ["{}_final".format(col) for col in ["Age", "Salary"]]
).setStrategy("mean")

In [61]:
# Add transformation to desired columns
imputer_learned = imputer.fit(df)

In [62]:
imputer_learned.transform(df).show()

+-----------------+----+------+--------------------+--------------------+------+---------+------------+
|             Name| Age|   Sex|             Address|             Contact|Salary|Age_final|Salary_final|
+-----------------+----+------+--------------------+--------------------+------+---------+------------+
|         John Doe|  30|  Male|   123 Main St, City|    john@example.com| 50000|       30|       50000|
|       Jane Smith|  25|Female|    456 Elm St, Town|    jane@example.com| 45000|       25|       45000|
|   Robert Johnson|  35|  Male| 789 Oak St, Village|  robert@example.com| 60000|       35|       60000|
|      Emily Davis|  28|Female| 101 Pine St, Hamlet|   emily@example.com| 55000|       28|       55000|
|    Michael Brown|  40|  NULL|222 Cedar St, County| michael@example.com| 70000|       40|       70000|
|     Sarah Wilson|  33|Female|333 Maple St, Suburb|   sarah@example.com|  NULL|       33|       54470|
|     James Miller|  29|  Male|444 Birch St, Tow...|   james@example.com| 52000|       29|       52000|
|      Lisa Garcia|  27|  NULL|555 Oakwood St, Town|    lisa@example.com| 48000|       27|       48000|
|      William Lee|  38|  NULL|666 Pinecrest St,...| william@example.com|  NULL|       38|       54470|
|    Olivia Taylor|  31|Female|777 Elmwood St, C...|  olivia@example.com| 57000|       31|       57000|
|  Daniel Martinez|NULL|  Male|                NULL|  daniel@example.com|  NULL|       31|       54470|
|    Sophia Harris|  26|Female|999 Cedarwood St,...|  sophia@example.com| 47000|       26|       47000|
|Christopher Davis|  34|  Male|111 Oakside St, V...|   chris@example.com| 61000|       34|       61000|
|    Emma Anderson|  24|Female|222 Elmridge St, ...|    emma@example.com| 44000|       24|       44000|
|     Joseph Smith|  37|  Male|333 Birchwood St,...|  joseph@example.com| 63000|       37|       63000|
|      Mia Johnson|  30|Female|444 Maplewood St,...|     mia@example.com| 49000|       30|       49000|
|     David Wilson|  36|  Male|555 Pinehurst St,...|   david@example.com| 64000|       36|       64000|
|        Ava Brown|  28|Female|666 Oakridge St, ...|     ava@example.com| 46000|       28|       46000|
|  Benjamin Taylor|  39|  Male|777 Cedarhurst St...|benjamin@example.com| 65000|       39|       65000|
|    Charlotte Lee|  29|Female|888 Elmridge St, ...|charlotte@example...| 50000|       29|       50000|
+-----------------+----+------+--------------------+--------------------+------+---------+------------+

- Median

In [63]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols = ["Age", "Salary"],
    outputCols = ["{}_final".format(col) for col in ["Age", "Salary"]]
).setStrategy("median")

# Add transformation to desired columns
imputer_learned = imputer.fit(df)

imputer_learned.transform(df).show()

+-----------------+----+------+--------------------+--------------------+------+---------+------------+
|             Name| Age|   Sex|             Address|             Contact|Salary|Age_final|Salary_final|
+-----------------+----+------+--------------------+--------------------+------+---------+------------+
|         John Doe|  30|  Male|   123 Main St, City|    john@example.com| 50000|       30|       50000|
|       Jane Smith|  25|Female|    456 Elm St, Town|    jane@example.com| 45000|       25|       45000|
|   Robert Johnson|  35|  Male| 789 Oak St, Village|  robert@example.com| 60000|       35|       60000|
|      Emily Davis|  28|Female| 101 Pine St, Hamlet|   emily@example.com| 55000|       28|       55000|
|    Michael Brown|  40|  NULL|222 Cedar St, County| michael@example.com| 70000|       40|       70000|
|     Sarah Wilson|  33|Female|333 Maple St, Suburb|   sarah@example.com|  NULL|       33|       52000|
|     James Miller|  29|  Male|444 Birch St, Tow...|   james@example.com| 52000|       29|       52000|
|      Lisa Garcia|  27|  NULL|555 Oakwood St, Town|    lisa@example.com| 48000|       27|       48000|
|      William Lee|  38|  NULL|666 Pinecrest St,...| william@example.com|  NULL|       38|       52000|
|    Olivia Taylor|  31|Female|777 Elmwood St, C...|  olivia@example.com| 57000|       31|       57000|
|  Daniel Martinez|NULL|  Male|                NULL|  daniel@example.com|  NULL|       30|       52000|
|    Sophia Harris|  26|Female|999 Cedarwood St,...|  sophia@example.com| 47000|       26|       47000|
|Christopher Davis|  34|  Male|111 Oakside St, V...|   chris@example.com| 61000|       34|       61000|
|    Emma Anderson|  24|Female|222 Elmridge St, ...|    emma@example.com| 44000|       24|       44000|
|     Joseph Smith|  37|  Male|333 Birchwood St,...|  joseph@example.com| 63000|       37|       63000|
|      Mia Johnson|  30|Female|444 Maplewood St,...|     mia@example.com| 49000|       30|       49000|
|     David Wilson|  36|  Male|555 Pinehurst St,...|   david@example.com| 64000|       36|       64000|
|        Ava Brown|  28|Female|666 Oakridge St, ...|     ava@example.com| 46000|       28|       46000|
|  Benjamin Taylor|  39|  Male|777 Cedarhurst St...|benjamin@example.com| 65000|       39|       65000|
|    Charlotte Lee|  29|Female|888 Elmridge St, ...|charlotte@example...| 50000|       29|       50000|
+-----------------+----+------+--------------------+--------------------+------+---------+------------+

- Mode

In [64]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols = ["Age", "Salary"],
    outputCols = ["{}_final".format(col) for col in ["Age", "Salary"]]
).setStrategy("mode")

# Add transformation to desired columns
imputer_learned = imputer.fit(df)

imputer_learned.transform(df).show()

+-----------------+----+------+--------------------+--------------------+------+---------+------------+
|             Name| Age|   Sex|             Address|             Contact|Salary|Age_final|Salary_final|
+-----------------+----+------+--------------------+--------------------+------+---------+------------+
|         John Doe|  30|  Male|   123 Main St, City|    john@example.com| 50000|       30|       50000|
|       Jane Smith|  25|Female|    456 Elm St, Town|    jane@example.com| 45000|       25|       45000|
|   Robert Johnson|  35|  Male| 789 Oak St, Village|  robert@example.com| 60000|       35|       60000|
|      Emily Davis|  28|Female| 101 Pine St, Hamlet|   emily@example.com| 55000|       28|       55000|
|    Michael Brown|  40|  NULL|222 Cedar St, County| michael@example.com| 70000|       40|       70000|
|     Sarah Wilson|  33|Female|333 Maple St, Suburb|   sarah@example.com|  NULL|       33|       50000|
|     James Miller|  29|  Male|444 Birch St, Tow...|   james@example.com| 52000|       29|       52000|
|      Lisa Garcia|  27|  NULL|555 Oakwood St, Town|    lisa@example.com| 48000|       27|       48000|
|      William Lee|  38|  NULL|666 Pinecrest St,...| william@example.com|  NULL|       38|       50000|
|    Olivia Taylor|  31|Female|777 Elmwood St, C...|  olivia@example.com| 57000|       31|       57000|
|  Daniel Martinez|NULL|  Male|                NULL|  daniel@example.com|  NULL|       28|       50000|
|    Sophia Harris|  26|Female|999 Cedarwood St,...|  sophia@example.com| 47000|       26|       47000|
|Christopher Davis|  34|  Male|111 Oakside St, V...|   chris@example.com| 61000|       34|       61000|
|    Emma Anderson|  24|Female|222 Elmridge St, ...|    emma@example.com| 44000|       24|       44000|
|     Joseph Smith|  37|  Male|333 Birchwood St,...|  joseph@example.com| 63000|       37|       63000|
|      Mia Johnson|  30|Female|444 Maplewood St,...|     mia@example.com| 49000|       30|       49000|
|     David Wilson|  36|  Male|555 Pinehurst St,...|   david@example.com| 64000|       36|       64000|
|        Ava Brown|  28|Female|666 Oakridge St, ...|     ava@example.com| 46000|       28|       46000|
|  Benjamin Taylor|  39|  Male|777 Cedarhurst St...|benjamin@example.com| 65000|       39|       65000|
|    Charlotte Lee|  29|Female|888 Elmridge St, ...|charlotte@example...| 50000|       29|       50000|
+-----------------+----+------+--------------------+--------------------+------+---------+------------+